app/views/trends/_trend.html.erb

<% @alltrends.each do |trend| %>
<div data-filter-item data-filter-name="<%= trend.name %>" class="trend trend-parent <%= if user_signed_in? && !current_user.trends.nil? && current_user.trends.split(',').include?(trend.id.to_s) then 'followed' end %>">
---
SELECT "trends".* FROM "trends"

                  <p class="trend-name">/<%= trend.name %></p>
                <p class="trend-details first"><%= Post.where(trendid: trend.id).size %> Posts</p>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at DESC LIMIT 4  [["trendid", 42]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."trendid" = ?  [["trendid", 42]]