app/views/trends/follow.js.erb

//alert("<%= current_user.trends %>")
$('.trend-parent.active').toggleClass('followed')
---
UPDATE "trends" SET "followers" = ?, "updated_at" = ? WHERE "trends"."id" = ?  [["followers", 67], ["updated_at", "2017-07-20 20:27:47.583355"], ["id", 42]]