app/views/trends/index.html.erb

SELECT "trends".* FROM "trends"
---
<body  data-no-turbolinks='true' id="<%= controller.action_name %>" class="trendy <% if user_signed_in? %> signed-in<% else %> not-signed-in<% end %>  <%= if request.original_url.include?('?app=true') then 'app' end %>">

SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at DESC LIMIT 4  [["trendid", 42]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."trendid" = ?  [["trendid", 42]]
---
        <p class="<%= if current_user.bio.blank?  then '' else 'progress-done' end %>">Write your bio</p>
        <p class="<%= if current_user.posts.count == 0 then '' else 'progress-done' end %>">Upload your first post</p>