app/views/trends/trend.html.erb

                    <% if post.trendid.present? %>
                          <a  class="new-post-trend not-link" target="_blank" href="/trends/<%= Trend.find_by_id(post.trendid).name %>">/<%= Trend.find_by_id(post.trendid).name %></a>
---
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]


                    <!--<span class="post-votes-word comment-number"><%= post.comments.count %></span>-->
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 294]]


                    <% elsif user_signed_in? && post.user == current_user && ((Time.now  - post.created_at).round / 1.minutes ) >= 90 && ( ((Time.now  - post.created_at).round / 1.minutes ) / 12 + post.get_upvotes.size - post.get_downvotes.size + 30) >= post.maxpushpoints %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 79]]