app/views/pages/admin.html.erb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "posts" WHERE (created_at >= '2017-07-18 00:00:00.000000')
---
    <div class="content-overlay"></div>
    <div class='wrapper'><%= User.count %> signups</div>
    <div class='wrapper'><%= Post.count %> posts</div>

SELECT COUNT(*) FROM "users" WHERE "users"."posted" = ? AND "users"."passed" IS NULL  [["posted", "t"]]
---
    <%= form_tag url_for(:controller => 'pages', :action => 'acceptUser'), :method => 'get', class: "i", remote: true do %>
                  <%= text_field_tag 'acceptAll', User.where(passed: nil, posted: true).size, class: "memeb-field-2",placeholder: 'eg. bananapeeler', id: "memeb-username-field" %>