app/views/pages/index.html.erb

            <h2 class="post-title"><%= post.title %></h2>
            <p class="post-user">+  @<%= post.user.username unless post.user.blank? %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]