app/views/pages/index.html.erb

        <p class="<%# if current_user.bio.blank?  then '' else 'progress-done' end %>">Write your bio</p>
        <p class="<%# if current_user.posts.count == 0 then '' else 'progress-done' end %>">Upload your first post</p>
---
SELECT "posts"."id" FROM "posts"  ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]

                        <% if post.trendid.present? %>
                          <a class="post-trend" href="/trends/<%= Trend.find_by_id(post.trendid).name %>">/<%= Trend.find_by_id(post.trendid).name %></a>
---
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]


                    <span class="post-votes-word comment-number"><%= post.comments.count %></span>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 8]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 294]]