app/views/pages/loadPost.js.erb

    $('#right-wrapper-' + <%= @postid %> ).removeClass('loading-2 loading')
    $('#left-wrapper-' + <%= @postid %> ).find('.loadPost').remove()
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 294]]