app/views/pages/newposts.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 79]]
---

        <div class="wrapper <%= if @followingPosts.include?(post) then 'userfollowed' end %> <%= if @popularPosts2.include?(post) then 'popular' end %> <% if user_signed_in? && !current_user.trends.nil? && current_user.trends.tr('[]', '').split(',').map(&:to_i).include?(post.trendid) %>followed<%else%>notfollowed<%end%> <%= if post.user == current_user then "mine" end %> <%= if user_signed_in? && (current_user.voted_on? post, vote_scope: 'report') then 'reported' elsif user_signed_in? && (current_user.voted_on? post, vote_scope: 'favor') then 'favorited' end %>" data-post-id="<%= post.id %>" id="wrapper-<%= post.id %>">

SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]
---
                        <% if post.trendid.present? %>
                          <a  class="new-post-trend" target="_blank" href="/trends/<%= Trend.find_by_id(post.trendid).name %>">/<%= Trend.find_by_id(post.trendid).name %></a>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 294]]
---

                    <span class="post-votes-word comment-number"><%= post.comments.count %></span>