app/views/pages/profile.html.erb

            <% if user_signed_in? && @user == current_user %><a href="/settings"><i id="setting-button" class="material-icons">settings</i></a><% end %>
            <%= render '/layouts/follow_button', :user => User.find_by_username(params[:id]) %>
            <h2 id="posts-number"><%= @user.posts.count %> Posts</h2>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "user1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 4]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]