app/views/posts/index.html.erb

            <h2 class="post-title"><%= post.title %></h2>
            <p class="post-user">+  @<%= post.user.username unless post.user.blank? %> </p>
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC