app/views/posts/show.html.erb

                    <% if @post.trendid.present? %>
                          <a class="post-trend" href="/trends/<%= Trend.find_by_id(@post.trendid).name %>">/<%= Trend.find_by_id(@post.trendid).name %></a>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]


                    <span class="post-votes-word comment-number"><%= @post.comments.count %></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 294]]

                                            <% if user_signed_in? %>
                            <span class="post-votes-word" data-points="<%= @post.get_upvotes.size - @post.get_downvotes.size - if current_user.voted_up_on? @post then 1 elsif current_user.voted_down_on? @post then -1 else 0 end %>" data-user-votes="<%= if current_user.voted_up_on? @post then 1 elsif current_user.voted_down_on? @post then -1 else 0 end %>"><%=  @post.get_upvotes.size - @post.get_downvotes.size %></span>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 79]]