app/controllers/pages_controller.rb

def index
  @challengepost = Post.last
    if user_signed_in? && current_user.new == true
      redirect_to current_user.posts.first
    else
    @randomPic = rand(1..75)
    @alltrends = Trend.all
    #if user_signed_in? && current_user.passed != true && Time.now - current_user.created_at  < 10
    #  #redirect_to '/make'
   #   puts "nothing"
    #else

    unless session[:display_welcome]
        @welcomeMessage = true
        session[:display_welcome] = true
    end
    @alltrends = Trend.all.sort_by{|e| e[:posts]}.reverse
    if user_signed_in?
      if current_user.trends.nil?
        @trends = []
      else
        @trends = Trend.where(id: current_user.trends.tr('[]', '').split(',').map(&:to_i))
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 10
SELECT "posts".* FROM "posts"
SELECT "trends".* FROM "trends"
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at ASC LIMIT 1  [["trendid", 42]]
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at DESC LIMIT 4  [["trendid", 42]]
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]

      end
      @randomUsers = User.where.not(:id => current_user.following).except(current_user).limit(4)

      @popularPosts = Post.where(hidden: nil).where('cached_votes_up > 0')
      @trendPosts = Post.where(trendid: @trendArray, hidden: nil)#.where('cached_votes_up > -1')
      @followingPosts = Post.where(hidden: nil).where(:user_id => current_user.following)#.where("created_at < ?", 2.days.ago)
      @popularPosts2 = @popularPosts.reject{ |e| @trendPosts.include? e }.reject{ |e| @followingPosts.include? e }
---
SELECT "posts".* FROM "posts" WHERE "posts"."hidden" IS NULL AND (cached_votes_up > 10)  ORDER BY created_at DESC
SELECT "posts".* FROM "posts" WHERE "posts"."trendid" IN (0, 0, 6, 7, 4, 5, 3, 2, 24, 25, 26, 9, 3) AND "posts"."hidden" IS NULL  ORDER BY created_at DESC
SELECT  1 AS one FROM "posts" WHERE "posts"."trendid" = ? LIMIT 1  [["trendid", 42]]

      @post = @post2.sort_by{|e| e[:time_ago]}.reject{ |e| current_user.posts.include? e }
      @mcpost = current_user.posts.where(:mc => true).where("created_at > ?", 10.minutes.ago).limit(1)
      if @mcpost.present?
        puts @mcpost.first.hidden
---
SELECT  "posts".* FROM "posts" WHERE "posts"."hidden" IS NULL  ORDER BY created_at DESC LIMIT 10 OFFSET 0

      #@post = Post.limit(30).paginate(:per_page => 10, :page => params[:page])
      @pre_newposts = Post.where(hidden: nil).where('cached_votes_up < 10').order("created_at DESC")
      @newposts = @pre_newposts.reject{ |e| @post.include? e }.reject{ |e| current_user.posts.include? e }
      @newposts = @newposts.paginate(:per_page => 9, :page => params[:page])
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 53]]

      # add the user not nil !!!!!
    else
      @popularPosts = Post.where(hidden: nil).where('cached_votes_up > 3').order("created_at DESC")
      @post = @popularPosts.paginate(:per_page => 10, :page => params[:page])
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."hidden" IS NULL

  def newposts
  @challengepost = Post.last
    if user_signed_in? && current_user.new == true
      redirect_to current_user.posts.first
    else
    @randomPic = rand(1..75)
    @alltrends = Trend.all
    #if user_signed_in? && current_user.passed != true && Time.now - current_user.created_at  < 10
    #  #redirect_to '/make'
   #   puts "nothing"
    #else

    unless session[:display_welcome]
        @welcomeMessage = true
        session[:display_welcome] = true
    end
    @alltrends = Trend.all.sort_by{|e| e[:posts]}.reverse
    if user_signed_in?
      if current_user.trends.nil?
        @trends = []
      else
        @trends = Trend.where(id: current_user.trends.tr('[]', '').split(',').map(&:to_i))
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 10
SELECT "trends".* FROM "trends"
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at ASC LIMIT 1  [["trendid", 42]]
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at DESC LIMIT 4  [["trendid", 42]]
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]

      end
      @randomUsers = User.where.not(:id => current_user.following).except(current_user).limit(4)

      @popularPosts = Post.where(hidden: nil).where('cached_votes_up > 0')
      @trendPosts = Post.where(trendid: @trendArray, hidden: nil)#.where('cached_votes_up > -1')
      @followingPosts = Post.where(hidden: nil).where(:user_id => current_user.following)#.where("created_at < ?", 2.days.ago)
      @popularPosts2 = @popularPosts.reject{ |e| @trendPosts.include? e }.reject{ |e| @followingPosts.include? e }
---
SELECT "posts".* FROM "posts" WHERE "posts"."hidden" IS NULL AND (cached_votes_up < 10)  ORDER BY created_at DESC
SELECT  1 AS one FROM "posts" WHERE "posts"."trendid" = ? LIMIT 1  [["trendid", 42]]

      @post = @post2.sort_by{|e| e[:time_ago]}.reject{ |e| current_user.posts.include? e }
      @mcpost = current_user.posts.where(:mc => true).where("created_at > ?", 10.minutes.ago).limit(1)
      if @mcpost.present?
        puts @mcpost.first.hidden
---
SELECT  "posts".* FROM "posts" WHERE "posts"."hidden" IS NULL  ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def admin
    if user_signed_in?
      current_user.trends = nil
      current_user.save
---
UPDATE "users" SET "pic" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["pic", 35], ["updated_at", "2017-07-18 09:54:26.308926"], ["id", 1]]

    end
=end

    @users = User.where(pic: nil)
---
SELECT "users".* FROM "users" WHERE "users"."pic" IS NULL

  def renderTrends
    @alltrends = Trend.all
---
SELECT "trends".* FROM "trends"

  def acceptUser
    if params[:userid]
      puts params[:userid]
      @newuser = User.find( params[:userid] )
      @newuser.passed = true
      @newuser.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
UPDATE "users" SET "passed" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["passed", "t"], ["updated_at", "2017-07-23 21:55:39.557788"], ["id", 79]]

  def loadPost
    @postid = params[:postid]
    @post = Post.find(@postid)
    @comment11 = @post.comments.where(hidden: nil).where('cached_votes_score < 0').where('cached_votes_score > -3').ordered
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 294]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."hidden" IS NULL AND (cached_votes_score > 1279) AND (cached_votes_score < 2560)  ORDER BY "comments"."created_at" DESC  [["post_id", 294]]

  def load_activities
    @activities = PublicActivity::Activity.order('created_at DESC').where( (PublicActivity::Activity.key == 'upvoting' && PublicActivity::Activity.trackable.user == current_user && PublicActivity::Activity.owner != current_user)  || PublicActivity::Activity.key == 'posting' && PublicActivity::Activity.trackable.user != current_user && current_user.following?(PublicActivity::Activity.trackable.user)  || PublicActivity::Activity.key == 'commenting' && PublicActivity::Activity.trackable.user != current_user ).limit(20)
---
SELECT "activities".* FROM "activities" WHERE "activities"."key" = ? AND "activities"."owner_id" IN (1, 2, 3, 4, 5, 7, 32) AND (created_at >= '2017-07-22 10:47:37.997828')  ORDER BY created_at DESC  [["key", "posting"]]

  def profile
    @recusers = User.where.not(username: nil).order("RANDOM()").first(20)
    if (User.find_by_username(params[:id]))
      @username = params[:id]
      @user = User.find_by_username(params[:id])
    else
      redirect_to root_path, :notice => "User not found"
    end
    @profilepost = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id ).where(hidden: [false, nil]).where(anonymous: [nil, false]).paginate :page => params[:page], :per_page => 10
---
SELECT  "users".* FROM "users" WHERE ("users"."username" IS NOT NULL)  ORDER BY RANDOM() LIMIT 20
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "casper"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 53]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 4]]
SELECT COUNT(*) FROM "posts" WHERE (user_id = 53) AND "posts"."hidden" IS NULL AND "posts"."anonymous" = ?  [["anonymous", "f"]]

  def checkUsername
    if params[:user].present?
      @params = params[:user][:name]
      if @params != current_user.username
        if @params.length < 3
          @usernamecheck = true
        else
          if @params.length > 20
            @usernamecheck = true
          end
          @usernamecheck = User.exists?(username: @params)
---
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "malek1"]]