app/controllers/pages_controller.rb

  def make
    if user_signed_in?
      @activities1 = PublicActivity::Activity.order("created_at DESC").where( recipient: current_user)
      @activities0 = PublicActivity::Activity.order("created_at DESC").where( owner_id: current_user.following.ids, key: "posting" ).where('created_at >= ?', Time.now-2.days)
      @activities2 = PublicActivity::Activity.where( key: 'drolling').order("created_at DESC")
      @activities3 = [@activities1, @activities2, @activities0].flatten
      @activities = @activities3.sort_by{|e| e[:created_at]}.reverse.paginate(:per_page => 25, :page => 1)
      @post = current_user.posts.build(params[:post])
      @stock1 = current_user.stocks.where(stocktype: 'meme').order("created_at DESC")
      @stock2 = current_user.stocks.where(stocktype: 'rage').order("created_at DESC")

    end
    @trends = Trend.all.limit(15)
---
SELECT  "trends".* FROM "trends"  ORDER BY RANDOM() LIMIT 15