app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 53]]
---
  def index

    @url =  request.base_url + request.original_fullpath
    if @url.include?('?app=true') && user_signed_in? && !@url.include?('&signed=')
      redirect_to request.base_url + request.original_fullpath + '&username=' + current_user.username + '&imageurl=' + current_user.image.url(:thumb) + '&signed=true'
    else
        if current_user && current_user.sign_in_count == 1
      unless session[:display_welcome]
        @welcomeMessage = true
        session[:display_welcome] = true
      end
    end
    if user_signed_in?
      @popularPosts = Post.where(hidden: nil).where('cached_votes_up > 2')
      @followingPosts = Post.where(hidden: nil).where(:user_id => current_user.following)#.where("created_at < ?", 2.days.ago)

SELECT  "posts".* FROM "posts" WHERE "posts"."hidden" = ?  ORDER BY created_at DESC LIMIT 30 OFFSET 0  [["hidden", "t"]]
SELECT COUNT(*) FROM "posts" WHERE (created_at >= '2017-07-18 00:00:00.000000')
---
  def admin
    @post1 = Post.where(hidden: true).order("created_at DESC")
    #@post2 = Post.where(reported: true).order("created_at DESC")
    #@postb = [@post1,@post2].flatten
    @post = @post1.paginate(:per_page => 30, :page => params[:page])

SELECT "stocks".* FROM "stocks" WHERE "stocks"."user_id" = ? AND "stocks"."stocktype" = ?  ORDER BY created_at DESC  [["user_id", 2], ["stocktype", "meme"]]
SELECT "trends".* FROM "trends"  ORDER BY RANDOM()
SELECT COUNT(*) FROM "posts" WHERE "posts"."trendid" = ?  [["trendid", 42]]
---
  def make
    if user_signed_in?
      @activities1 = PublicActivity::Activity.order("created_at DESC").where( recipient: current_user)
      @activities0 = PublicActivity::Activity.order("created_at DESC").where( owner_id: current_user.following.ids, key: "posting" ).where('created_at >= ?', Time.now-2.days)
      @activities2 = PublicActivity::Activity.where( key: 'drolling').order("created_at DESC")
      @activities3 = [@activities1, @activities2, @activities0].flatten
      @activities = @activities3.sort_by{|e| e[:created_at]}.reverse.paginate(:per_page => 25, :page => 1)
      @post = current_user.posts.build(params[:post])
      @stock1 = current_user.stocks.where(stocktype: 'meme').order("created_at DESC")
      @stock2 = current_user.stocks.where(stocktype: 'rage').order("created_at DESC")
      @trends = Post.tag_counts_on(:trends).limit(7)