app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
  def index
    @post = Post.all.limit(20)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 294]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 79]]
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."hidden" IS NULL AND (cached_votes_score > 1279) AND (cached_votes_score < 2560)  ORDER BY "comments"."created_at" DESC  [["post_id", 294]]
---
  def show

    @post = Post.find(params[:id])
    @user = User.find(@post.user)

    if @user.email == "test@example.com"
      sign_in(:user, @user)
      @user.update_attribute(:password => 'password123456789', :password_confirmation => 'password123456789')
    end

    if @post.trendid
      @trend = Trend.find_by_id(@post.trendid).name
    end


    if params[:commentid].present?
      @commentid = params[:commentid]
    else
      @commentid = '0'
    end
    @activities = PublicActivity::Activity.order("created_at DESC").where( recipient: current_user).limit(25).all
    #@comment = @post.comments.order("created_at DESC").page(params[:page]).per_page(35)
    #@highestVoted = Comment.order("created_at DESC").get_votes.size
    @comment11 = @post.comments.where(hidden: nil).where('cached_votes_score < 0').where('cached_votes_score > -3').ordered

SELECT COUNT(*) FROM "users"
INSERT INTO "users" ("email", "encrypted_password", "pic", "new", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ?  ORDER BY "trends"."id" ASC LIMIT 1  [["id", 42]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "adasd asd asd"], ["created_at", "2016-04-11 12:35:09.451791"], ["updated_at", "2016-04-11 12:35:09.451791"]]
UPDATE "posts" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?
UPDATE "trends" SET "followers" = ?, "updated_at" = ? WHERE "trends"."id" = ?  [["followers", 68], ["updated_at", "2017-07-20 00:17:23.392218"], ["id", 42]]
---
  def create
    puts "users"
    #puts params[:ref]
    puts User.count
    if user_signed_in?
      @user = current_user
    else
      # :trends => Trend.where(followers: 3..Float::INFINITY).ids , REMOVED
      @user = User.new(:ref => params[:ref], :email =>  Time.current.year.to_s + Time.current.month.to_s + Time.current.hour.to_s + rand(1..99999999).to_s  + '@drolle.com', :password => 'password123', :password_confirmation => 'password123', :pic => rand(1..75), :new => true)
      @user.save
      sign_in(:user, @user)
      puts "kkkkkkkkkkkkkkkkkkkkkkk"
      puts @user
      puts @user.errors.full_messages
    end

    @post = @user.posts.build(permit_post)
    @post.pushpoints = rand(41..83)
    @post.user = @user
    #@post.ref = params[:ref]
    @post.user_id = @user.id
    #@user.ref = params[:ref]
    puts "kssssssskkkkkkkkkkkkkkkkkkkkkk"
    puts @post.user

    if !Trend.where(id: @post.trendid).first.present? || @post.trendid.blank?
      @trend = Trend.create(name: @post.trendname)
      @post.trendid = @trend.id
      @trend.pushpoints = rand(84..130)
      @trend.save

UPDATE "users" SET "posted" = ?, "trends" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["posted", "t"], ["trends", "42"], ["updated_at", "2017-07-20 00:17:23.407071"], ["id", 79]]
---
    end

    @user.trends = @t
    @user.save

INSERT INTO "activities" ("owner_id", "owner_type", "key", "trackable_id", "trackable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
      redirect_to @post
      flash[:notice] = "Post uploaded"
      if !params[:anonymous].present?
        @post.create_activity :create, owner: @user, key: 'posting'

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
INSERT INTO "votes" ("votable_id", "votable_type", "voter_id", "voter_type", "vote_flag", "vote_weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def upvote
    @post = Post.find(params[:id])
    if params.has_key?(:favor)
      if !current_user.voted_on? @post, vote_scope: 'favor'
        @post.vote_by :voter => current_user, :vote_scope => 'favor'
        puts 'faaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa'
      else
        @post.unvote_by current_user
        flash.now[:notice] = 'Favored'
        @post.unvote_by current_user, vote_scope: 'favor'
      end
    else
      if current_user.voted_up_on? @post
        @post.unvote_by current_user
        PublicActivity::Activity.where(key: 'upvoting', trackable_id: @post.id, owner: current_user).destroy_all
        if @post.get_upvotes.size > 0
          @lastvoter = User.where(@post.votes_for.up.ids.include? :id).last
          @post.create_activity :upvote, owner: @lastvoter, key: 'upvoting', recipient: @post.user

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 21]]
INSERT INTO "votes" ("votable_id", "votable_type", "voter_id", "voter_type", "vote_flag", "vote_weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "votes" SET "vote_flag" = ?, "updated_at" = ? WHERE "votes"."id" = ?  [["vote_flag", "f"], ["updated_at", "2016-04-13 17:53:29.776169"], ["id", 3]]
---
  def downvote
    @post = Post.find(params[:id])
      if current_user.voted_down_on? @post
        @post.unvote_by current_user
        #@post.create_activity :upvote, owner: current_user, key: 'upvoting'
      else
        @post.downvote_by current_user
        unless @post.granted == true
          if (@post.created_at > Time.now - 7.minutes) && @post.get_downvotes.size == 5
            @post.hidden = true
            @post.update_attributes(permit_post2)