app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(permit_post)
    @post.user = current_user
    @post.user_id = current_user.id

    if !Trend.where(name: @post.trendname).exists? || @post.trendid.blank?
---
SELECT  "trends".* FROM "trends" WHERE "trends"."name" = ?  ORDER BY "trends"."id" ASC LIMIT 1  [["name", "bro"]]