app/controllers/trends_controller.rb

  def index

    @url =  request.base_url + request.original_fullpath
    if @url.include?('?app=true') && user_signed_in? && !@url.include?('&signed=')
      redirect_to request.base_url + request.original_fullpath + '/?app=true&username=' + current_user.username + '&imageurl=' + current_user.image.url(:thumb) + '&signed=true'
    else
      @trends = Trend.all
    if user_signed_in?
      @randomUsers = User.where.not(:id => current_user.following).except(current_user).limit(4)
      unless session[:swipe]
        @swipeMessage = true
        session[:swipe] = true
      end
      @p1 = if current_user.posts.count == 0 then '0' else '1' end
      @p2 = if current_user.image.url(:medium) == 'missing.jpg' then '0' else '1' end
      @p3 = if current_user.cover.url(:medium) == 'missing-2.png' then '0' else '1' end
      @p4 = if current_user.bio.blank? then '0' else '1' end
      @pTotal = ( (@p1.to_f + @p2.to_f + @p3.to_f + @p4.to_f)/4 )*100

      #@activities = PublicActivity::Activity.order("created_at DESC").where(recipient: current_user).limit(25).all
      @activities1 = PublicActivity::Activity.order("created_at DESC").where( recipient: current_user)
      #@activities0 = PublicActivity::Activity.order("created_at DESC").where( owner_id: current_user.following.ids ).where( key: "posting" ).where("created_at > ?", PublicActivity::Activity.where(key: 'following', recipient: current_user, owner: ).created_at  )
      @activities0 = PublicActivity::Activity.order("created_at DESC").where( owner_id: current_user.following.ids, key: "posting" ).where('created_at >= ?', Time.now-2.days)
---
SELECT "trends".* FROM "trends"
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 53]]
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at DESC LIMIT 4  [["trendid", 42]]
SELECT "activities".* FROM "activities" WHERE "activities"."key" = ? AND 1=0 AND (created_at >= '2017-07-16 21:26:12.907169')  ORDER BY created_at DESC  [["key", "posting"]]

  def trend




=begin
    Post.all.each do |post|
      puts "starteddddddddddddddddddddddddddddddddddd"
      puts post.trend_list
      if !post.trend_list.blank?
        puts "passed first"
        @trendname = post.trend_list
        if post.trendid.blank?
---
SELECT  "trends".* FROM "trends" WHERE "trends"."name" = ?  ORDER BY "trends"."id" ASC LIMIT 1  [["name", "familyGatherings"]]


    @trend =  Trend.where(name: params[:name]).first

      @postnumber = Post.where(trendid: @trend.id, hidden: nil).size
---
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ? AND "posts"."hidden" IS NULL  ORDER BY created_at DESC LIMIT 35 OFFSET 0  [["trendid", 42]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."trendid" = ? AND "posts"."hidden" IS NULL  [["trendid", 42]]

        @swipeMessage = true
        session[:swipe] = true
      end
      @p1 = if current_user.posts.count == 0 then '0' else '1' end
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 53]]

      #@activities = PublicActivity::Activity.order("created_at DESC").where(recipient: current_user).limit(25).all
      @activities1 = PublicActivity::Activity.order("created_at DESC").where( recipient: current_user)
      #@activities0 = PublicActivity::Activity.order("created_at DESC").where( owner_id: current_user.following.ids ).where( key: "posting" ).where("created_at > ?", PublicActivity::Activity.where(key: 'following', recipient: current_user, owner: ).created_at  )
      @activities0 = PublicActivity::Activity.order("created_at DESC").where( owner_id: current_user.following.ids, key: "posting" ).where('created_at >= ?', Time.now-2.days)
---
SELECT "activities".* FROM "activities" WHERE "activities"."key" = ? AND "activities"."owner_id" IN (1, 2, 3, 4, 5, 7, 32) AND (created_at >= '2017-07-18 22:12:06.524744')  ORDER BY created_at DESC  [["key", "posting"]]

  def follow
    if user_signed_in? && !current_user.trends.nil?
      @t = current_user.trends#[1..-2].split(',').collect! {|n| n.to_i}
      puts current_user.trends
      puts "string"
    end

    @follow = false
    @thetrend = Trend.find( params[:user][:trendid] )
#=begin
    if current_user.trends.nil?
      @t = []
    else
      @t = @t.tr('[]', '').split(',').map(&:to_i)
    end
    #puts "before-" + current_user.trends
     if @t == []
       puts "ffffffffffffffff first"
       @t.push(params[:user][:trendid].to_i)
---
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 53]]
UPDATE "trends" SET "followers" = ?, "updated_at" = ? WHERE "trends"."id" = ?  [["followers", 67], ["updated_at", "2017-07-20 20:27:47.583355"], ["id", 42]]
UPDATE "users" SET "trends" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["trends", ""], ["updated_at", "2017-07-20 20:27:47.600712"], ["id", 53]]