app/views/layouts/_activities.html.erb


      <% if activity.owner.present? && activity.trackable.class.name == 'Post' && activity.trackable.user != current_user && current_user.following?(activity.trackable.user) && activity.key == 'posting'  %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 53]]

      <!--<span class="pointered" onclick='location.href="/user/<%# activity.trackable.username %>"'>-->
        <span class="pointered" <% if !request.original_url.include?('?app=true') %>onclick='location.href="/user/<%= activity.trackable.id %>"<% else %>data-a="/user/<%= activity.trackable.username %>"<% end %>'>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "casper"]]


     <% elsif activity.owner.present? && activity.trackable.class.name == 'Comment' && activity.key == 'commenting' && if !activity.trackable.post.nil? then  activity.trackable.post.user == current_user end %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 294]]