app/views/layouts/_pick_trend.html.erb

            <p class="pick-tags-title-2">Type <span id="type-word">Meme</span>   Trend <span id="trend-word">/samirIsABoy</span>
            <% if user_signed_in? &&  current_user.passed.nil? && current_user.posts.count == 1 %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."trendid" = ?  [["trendid", 42]]

              <span data-name="<%= trend.name %>" data-trendid="<%= trend.id %>" class="pick-trends new">/<%= trend.name %></span>
              <% if Post.where(trendid: trend.id).last().image.present? %><img src="<%= Post.where(trendid: trend.id).last().image.url(:medium) %>" class="post-" alt="<%= Post.where(trendid: trend.id).last().title %>"><% end %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at DESC LIMIT 4  [["trendid", 42]]