app/views/layouts/_trends.html.erb

        <% @trends.each do |trend| %>
            <div data-filter-item data-filter-name="<%= trend.name %>" class="trend second trend-parent <%= if user_signed_in? && !current_user.trends.nil? && current_user.trends.split(',').include?(trend.id.to_s) then 'followed' end %>">
---
SELECT "trends".* FROM "trends"

                <!--<a href="trends/<%= trend.name %>"></a>-->
                <div class="trend-last-image" style="background-image: url(<%= if Post.where(trendid: trend.id).exists? then Post.where(trendid: trend.id).last.image.url(:medium) end %>)"></div>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."trendid" = ?  ORDER BY created_at DESC LIMIT 4  [["trendid", 42]]
SELECT  1 AS one FROM "posts" WHERE "posts"."trendid" = ? LIMIT 1  [["trendid", 42]]

                <!--
                <p class="trend-details first"><%= Post.where(trendid: trend.id).size %> Posts</p>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."trendid" = ?  [["trendid", 42]]