app/views/layouts/_who_to_follow.html.erb


                    <p class="post-new-p <%= if post.title.blank? then "empty" end %>"><!--<a  target="_blank" href="user/<%= post.user.username %>"><span class="post-new-username">@<%= post.user.username %></span></a>--> <%= post.title unless post.title.nil? %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 79]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

                        <!--
                    <a  target="_blank" href="trends/<%= Trend.find(post.trendid).name %>"><p class="post-new-trend">/<%= Trend.find(post.trendid).name %><i class="material-icons">keyboard_arrow_right</i></p></a>
---
SELECT  "trends".* FROM "trends" WHERE "trends"."id" = ? LIMIT 1  [["id", 42]]

        <div id="box-4-wrapper-inside">
            <% Post.limit(10).each do |post| %>
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 10